app/controllers/messages_controller.rb

INSERT INTO "messages" ("content") VALUES ($1) RETURNING "id"  [["content", "Bonjour"]]
---
  def create
    @message = Message.new(message_params)
    if @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @message = Message.find(params[:id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "content" = $1 WHERE "messages"."id" = $2  [["content", "Bonsoir"], ["id", 1]]
---
  def update
    @message = Message.find(params[:id])
    if @message.update(message_params)

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 2]]
---
  def destroy
    @message.destroy

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_message
    @message = Message.find(params[:id])